app/controllers/reviews_controller.rb

  def create
    @review = Review.new(review_params)
    @review.user_id = current_user.id
    @review.movie_id = @movie.id

    if @review.save
---
INSERT INTO "reviews" ("comment", "created_at", "movie_id", "rating", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["comment", "feqw"], ["created_at", "2015-05-05 17:06:04.937081"], ["movie_id", 1], ["rating", 5], ["updated_at", "2015-05-05 17:06:04.937081"], ["user_id", 3]]